In [66]:
import pandas as pd
import numpy as np

## ***Creating a DataFrame***

In [67]:
data={
    'Name':['ritik','rahul','sunny','amrit'],
    'Age':[21,22,23,22],
    'City':['bhabua','sasaram','varansi','pusauli'],
    'Salary':[76000,79000,89000,97000]   
}

In [68]:
pd.DataFrame(data)

    Name  Age     City  Salary
0  ritik   21   bhabua   76000
1  rahul   22  sasaram   79000
2  sunny   23  varansi   89000
3  amrit   22  pusauli   97000

In [69]:
data_list=[
          ['ritik', 21,'bhabua',76000],
	      ['rahul', 22,'sasaram',79000],
          ['sunny', 23,'varanasi',86000],
          ['amrit', 21,'kudra',89000]
] 
columns=['Name','Age','City','Salary']

In [70]:
df2=pd.DataFrame(data_list,columns=columns)
df2

    Name  Age      City  Salary
0  ritik   21    bhabua   76000
1  rahul   22   sasaram   79000
2  sunny   23  varanasi   86000
3  amrit   21     kudra   89000

## ***Selection and Indexing of Columns***

In [71]:
df2

    Name  Age      City  Salary
0  ritik   21    bhabua   76000
1  rahul   22   sasaram   79000
2  sunny   23  varanasi   86000
3  amrit   21     kudra   89000

In [72]:
df2['City']

0      bhabua
1     sasaram
2    varanasi
3       kudra
Name: City, dtype: object

In [73]:
df2[['Name','Salary']]

    Name  Salary
0  ritik   76000
1  rahul   79000
2  sunny   86000
3  amrit   89000

## ***Creating a new column***

In [74]:
df2['Designation']=['Engineer','Business','Officer','Broker']
df2

    Name  Age      City  Salary Designation
0  ritik   21    bhabua   76000    Engineer
1  rahul   22   sasaram   79000    Business
2  sunny   23  varanasi   86000     Officer
3  amrit   21     kudra   89000      Broker

## ***Removing Columns***

In [75]:
df2.drop('City',axis=1)

    Name  Age  Salary Designation
0  ritik   21   76000    Engineer
1  rahul   22   79000    Business
2  sunny   23   86000     Officer
3  amrit   21   89000      Broker

In [76]:
df2

    Name  Age      City  Salary Designation
0  ritik   21    bhabua   76000    Engineer
1  rahul   22   sasaram   79000    Business
2  sunny   23  varanasi   86000     Officer
3  amrit   21     kudra   89000      Broker

In [77]:
df2.drop('City',axis=1,inplace=True)
df2

    Name  Age  Salary Designation
0  ritik   21   76000    Engineer
1  rahul   22   79000    Business
2  sunny   23   86000     Officer
3  amrit   21   89000      Broker

In [78]:
df2.drop(0,axis=0)

    Name  Age  Salary Designation
1  rahul   22   79000    Business
2  sunny   23   86000     Officer
3  amrit   21   89000      Broker

## ***Selecting Rows***

In [79]:
df2

    Name  Age  Salary Designation
0  ritik   21   76000    Engineer
1  rahul   22   79000    Business
2  sunny   23   86000     Officer
3  amrit   21   89000      Broker

In [80]:
df2.loc[[0]]

    Name  Age  Salary Designation
0  ritik   21   76000    Engineer

In [81]:
df2.loc[[0,1]]

    Name  Age  Salary Designation
0  ritik   21   76000    Engineer
1  rahul   22   79000    Business

In [82]:
df2.iloc[3]

Name            amrit
Age                21
Salary          89000
Designation    Broker
Name: 3, dtype: object

## ***Selecting Subsets of Rows and Columns***

In [83]:
df2.loc[[0,1]][["Name","Salary"]]

    Name  Salary
0  ritik   76000
1  rahul   79000

In [84]:
df2.loc[[2,3]][["Name","Age"]]

    Name  Age
2  sunny   23
3  amrit   21

## ***Conditional Selection***

In [85]:
df2

    Name  Age  Salary Designation
0  ritik   21   76000    Engineer
1  rahul   22   79000    Business
2  sunny   23   86000     Officer
3  amrit   21   89000      Broker

In [86]:
df2[df2["Age"]>21]

    Name  Age  Salary Designation
1  rahul   22   79000    Business
2  sunny   23   86000     Officer

In [87]:
# df2[df2["Age"]>21 & df2["Salary"]>80000]
df2[(df2["Age"] > 21) & (df2["Salary"] > 80000)]

    Name  Age  Salary Designation
2  sunny   23   86000     Officer